{"past_simple_singular":["«Avatar» was directed by James Cameron.","Hamlet was written by William Shakespeare.","This chairs were bought at a local market last year.","The boat was carried away by the waves."],"past_simple_plural":["This chairs were bought at a local market last year.","The floors were cleaned a few days ago.","These photos were taken during the trip to the Alps.","The robbers were not found."],"present_simple_singular":["This jam is made of fresh strawberries.","The film is based on real life events.","This jacket is made of leather.","The garden is taken care of by a gardener."],"present_simple_plural":["Toyota cars are made in Japan.","The floors are covered with carpets.","The children are looked after by a nanny.","The letters are delivered to Mr. Brown every morning."],"future_simple_singular":["A new movie will be shown on TV tonight.","The writer’s book will be published in August.","The car will be washed today.","The conversation will be recorded."],"future_simple_plural":["The pictures will be hung on the wall tomorrow.","We will be informed about it by e-mail.","All the letters will be written by the children.","Her interests will be protected."],"past_progressive_singular":["The story was being told the whole evening.","Filip was being talked about all day.","English was being taught when I came to the class.","The room was being cleaned while we were sitting outside."],"past_progressive_plural":["The kites were being flown by the children.","The bikes were being repaired when we entered the garage.","The kids were being hugged at the party by everyone.","The leaves were gradually getting yellow."],"present_progressive_singular":["My car is being fixed by a mechanic.","Dinner is being served on the terrace.","The house across the street is being built.","Are you being helped by anyone?"],"present_progressive_plural":["The boats are being cleaned by the men.","The flowers are being watered.","These patients are being treated more effectively.","These notes are being written on a gloriously sunny February day."],"past_perfect_singular":["They said the window had already been cleaned.","The steak hadn’t been cooked well,so we sent it back to the kitchen.","The letter had just been delivered when I arrived.","The meeting was a mess because it hadn’t been planned by anyone."],"past_perfect_plural":["No arrangements had been made before we arrived.","They had had their old car for five years when they bought a new one.","All tickets had been sold out before we even heard about the concert.","When they came to the office,the documents hadn't been signed."],"present_perfect_singular":["The building has just been renovated.","The article hasn’t been written yet.","The parcel has already been delivered.","The text has been translated by James."],"present_perfect_plural":["All the dishes have been made by the chef.","These documents have been brought by your secretary.","The flowers have already been watered.","The cats have been fed by mother."],"future_perfect_singular":["Will our life have been changed by 2080?","This difficult rule will have been learned by Tuesday.","Colonization of other planets will have been begun.","The weather will have been controlled by people."],"future_perfect_plural":["Space elevators will have been launched.","Workers will probably not have been replaced by robots.","Our brains will have been wired to computers.","Huge buildings will have become our living spaces."]}